#include "uart.h"

void _start_c(void) {
    uart_init();
    uart_write_string("\n╔════════════════════════════════════════════════════════════════╗\n");
    uart_write_string("║               Hart 3 - Application 3                           ║\n");
    uart_write_string("╚════════════════════════════════════════════════════════════════╝\n\n");
    
    /* Main loop - Hart 3 monitoring */
    while (1) {
        uart_write_string("[APP3] Hallo from Hart 3\n\n");
        // __asm__ volatile ("wfi");
    }
}
